/*
	P5730 【深基5.例10】显示屏
	https://www.luogu.com.cn/problem/P5730
	
	液晶屏上，每个阿拉伯数字都是可以显示成 3 * 5 的点阵的（其中 X 表示亮点，. 表示暗点）。
	现在给出数字位数（不超过 100）和一串数字，要求输出这些数字在显示屏上的效果。
	数字的显示方式如同样例输出，注意每个数字之间都有一列间隔。
*/

//https://www.luogu.com.cn/record/58429986

#include<iostream>
using namespace std;
char a[10][5][3]={
	{
		'X','X','X',
		'X','.','X',
		'X','.','X',
		'X','.','X',
		'X','X','X',
	},
	{
		'.','.','X',
		'.','.','X',
		'.','.','X',	
		'.','.','X',
		'.','.','X',
	},
	{
		'X','X','X',
		'.','.','X',
		'X','X','X',
		'X','.','.',
		'X','X','X',
	},
	{
		'X','X','X',
		'.','.','X',
		'X','X','X',
		'.','.','X',
		'X','X','X',
	},
	{
		'X','.','X',
		'X','.','X',
		'X','X','X',
		'.','.','X',
		'.','.','X',
	},
	{
		'X','X','X',
		'X','.','.',
		'X','X','X',
		'.','.','X',
		'X','X','X',
	},
	{
		'X','X','X',
		'X','.','.',
		'X','X','X',
		'X','.','X',
		'X','X','X',
	},
	{
		'X','X','X',
		'.','.','X',
		'.','.','X',
		'.','.','X',
		'.','.','X',
	},
	{
		'X','X','X',
		'X','.','X',
		'X','X','X',
		'X','.','X',
		'X','X','X',
	},
	{
		'X','X','X',
		'X','.','X',
		'X','X','X',
		'.','.','X',
		'X','X','X',
	}
};

int main(){
	char s[101];
	int n;
	cin>>n;
	for(int i=0;i<n;i++){
		cin>>s[i];
	}
	for(int l=0;l<5;l++){ //行
		for(int k=0;k<n;k++){ //个数
			for(int m=0;m<3;m++){ //列
				cout<<a[s[k]-'0'][l][m];
			}
			if(k!=n-1){
				cout<<".";
			}
		}
		cout<<endl;
	}
	return 0;
}